In [125]:
import numpy as np
import pandas as pd
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns
import statistics as sts

pd.set_option('display.max_columns', None)
pd.set_option('display.width', 150)
pd.set_option('display.max_rows', 20)

In [126]:
# Lendo o arquivo
vendas = pd.read_csv('Dados/vendas-por-fatura.csv', sep=",")
vendas.head(10)

  N° da fatura       Data da fatura  ID Cliente            País  Quantidade   Valor
0       548370   3/30/2021 16:14:00     15528.0  United Kingdom         123  229,33
1       575767  11/11/2021 11:11:00     17348.0  United Kingdom         163  209,73
2      C570727  10/12/2021 11:32:00     12471.0         Germany          -1   -1,45
3       549106    4/6/2021 12:08:00     17045.0  United Kingdom           1   39,95
4       573112  10/27/2021 15:33:00     16416.0  United Kingdom         357  344,83
5       576630   11/16/2021 8:38:00     13816.0         Germany          91  199,98
6       538125   12/9/2020 15:46:00     18225.0  United Kingdom          16   30,00
7       544354   2/18/2021 10:42:00     13489.0  United Kingdom          64   77,28
8       546369   3/11/2021 11:41:00     15513.0  United Kingdom          10   67,50
9       570651  10/11/2021 13:34:00     14911.0            EIRE          86  321,35

In [127]:
vendas.describe(exclude='number')

       N° da fatura      Data da fatura            País  Valor
count         25953               25953           25953  25953
unique        25900               23260              38  17540
top          550333  5/10/2021 15:05:00  United Kingdom   0,00
freq              2                   6           23542   2105

In [128]:
# Verificando o shape
vendas.shape

(25953, 6)

In [129]:
# Verificando os tipos de dados
vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25953 entries, 0 to 25952
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   N° da fatura    25953 non-null  object
 1   Data da fatura  25953 non-null  object
 2   ID Cliente      22229 non-null  float64
 3   País            25953 non-null  object
 4   Quantidade      25953 non-null  int64
 5   Valor           25953 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 1.2+ MB

In [130]:
# Verificando se existem valores nulos
vendas.isnull().sum()

N° da fatura         0
Data da fatura       0
ID Cliente        3724
País                 0
Quantidade           0
Valor                0
dtype: int64

In [131]:
# Verificando os valores unicos na coluna 'País'
vendas['País'].unique()

array(['United Kingdom', 'Germany', 'EIRE', 'France', 'Sweden', 'Belgium',
       'Italy', 'Japan', 'Israel', 'Portugal', 'Netherlands',
       'Channel Islands', 'Switzerland', 'Finland', 'Spain', 'Malta',
       'Singapore', 'United Arab Emirates', 'Norway', 'Hong Kong',
       'Denmark', 'Australia', 'USA', 'Poland', 'Lithuania',
       'European Community', 'Austria', 'Cyprus', 'Iceland',
       'Unspecified', 'Canada', 'Greece', 'Czech Republic', 'Lebanon',
       'Brazil', 'RSA', 'Bahrain', 'Saudi Arabia'], dtype=object)

In [132]:
# Substituindo os valores 'RSA' por 'South Africa'
vendas['País'] = vendas['País'].replace('RSA', 'South Africa')

In [133]:
# Verificando valores faltantes na coluna 'País'
print(contagem_pais.get('Unspecified', 0))

13

In [134]:
# Removendo linhas com valores 'Unspecified'
vendas = vendas[vendas['País'] != 'Unspecified']

In [135]:
# Verificando o resultado da limpeza anterior
vendas['País'].unique()

array(['United Kingdom', 'Germany', 'EIRE', 'France', 'Sweden', 'Belgium',
       'Italy', 'Japan', 'Israel', 'Portugal', 'Netherlands',
       'Channel Islands', 'Switzerland', 'Finland', 'Spain', 'Malta',
       'Singapore', 'United Arab Emirates', 'Norway', 'Hong Kong',
       'Denmark', 'Australia', 'USA', 'Poland', 'Lithuania',
       'European Community', 'Austria', 'Cyprus', 'Iceland', 'Canada',
       'Greece', 'Czech Republic', 'Lebanon', 'Brazil', 'South Africa',
       'Bahrain', 'Saudi Arabia'], dtype=object)

In [136]:
# Visualizando as linhas com valores ausentes na coluna 'ID Cliente'
linhas_nulas = vendas.loc[vendas['ID Cliente'].isnull()]
print(linhas_nulas.sample(20))

      N° da fatura       Data da fatura  ID Cliente            País  Quantidade    Valor
28          562417    8/4/2021 16:32:00         NaN  United Kingdom         526  1691,38
11870       575696  11/10/2021 16:45:00         NaN  United Kingdom           8    10,00
6144        546023    3/8/2021 17:29:00         NaN  United Kingdom        -975     0,00
8724        558742    7/1/2021 15:56:00         NaN  United Kingdom          -1     0,00
633         568411   9/27/2021 10:52:00         NaN  United Kingdom         426  2886,66
22630       566924   9/15/2021 15:17:00         NaN  United Kingdom          15     0,00
11620       574757   11/7/2021 10:08:00         NaN  United Kingdom         -54     0,00
21108       542999    2/2/2021 12:16:00         NaN  United Kingdom          60   523,31
24745       549034    4/5/2021 17:08:00         NaN  United Kingdom           2     0,00
15626       547009   3/18/2021 14:40:00         NaN  United Kingdom           1     1,25
2217        566985   9/16/2021 10:42:00         NaN  United Kingdom         312  2117,26
18429       579460  11/29/2021 14:39:00         NaN  United Kingdom        -151     0,00
16883       539649  12/20/2020 16:09:00         NaN  United Kingdom          10    42,12
12844       565917    9/7/2021 16:15:00         NaN  United Kingdom         411  1752,59
12845       567671   9/21/2021 15:34:00         NaN  United Kingdom         597  2199,28
19249       538044   12/9/2020 13:11:00         NaN  United Kingdom          16    21,30
23671       551009    4/26/2021 9:50:00         NaN  United Kingdom         146  1065,19
16154       538133   12/9/2020 15:56:00         NaN  United Kingdom           3     0,00
7582        557036   6/16/2021 13:53:00         NaN  United Kingdom        -271     0,00
9228       C572448  10/24/2021 12:28:00         NaN  United Kingdom          -2  -329,51

In [137]:
# Verificando os registros afetados com valores nulos 
linhas_nulas['País'].unique()

array(['United Kingdom', 'Hong Kong', 'Switzerland', 'EIRE', 'France',
       'Israel', 'Portugal', 'Bahrain'], dtype=object)

In [138]:
# Substituindo as vírgulas por pontos na coluna 'Valor'
vendas['Valor'] = vendas['Valor'].str.replace(',', '.')

# Convertendo a coluna 'Valor' de object para float64
vendas['Valor'] = vendas['Valor'].astype(float)

# Verificando se o separador de casas decimais foi alterado
vendas.sample(5)

      N° da fatura       Data da fatura  ID Cliente            País  Quantidade    Valor
14903       572914  10/26/2021 16:25:00     12948.0  United Kingdom          68   127.68
15192       577805   11/22/2021 8:19:00     13881.0  United Kingdom         658  1459.76
12070       544915   2/24/2021 15:41:00     13777.0  United Kingdom          90   179.04
7436        552734   5/11/2021 10:49:00     17428.0  United Kingdom         824  1160.67
4175        558382   6/28/2021 17:28:00     17997.0  United Kingdom         261   322.53

In [139]:
# Verificando se a coluna 'Valor' foi convertida para o tipo correto
vendas.info()

<class 'pandas.core.frame.DataFrame'>
Index: 25940 entries, 0 to 25952
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   N° da fatura    25940 non-null  object
 1   Data da fatura  25940 non-null  object
 2   ID Cliente      22221 non-null  float64
 3   País            25940 non-null  object
 4   Quantidade      25940 non-null  int64
 5   Valor           25940 non-null  float64
dtypes: float64(2), int64(1), object(3)
memory usage: 1.4+ MB

In [140]:
# Exibindo novamente as 5 primeiras linhas para servir de referência
vendas.head(5)

  N° da fatura       Data da fatura  ID Cliente            País  Quantidade   Valor
0       548370   3/30/2021 16:14:00     15528.0  United Kingdom         123  229.33
1       575767  11/11/2021 11:11:00     17348.0  United Kingdom         163  209.73
2      C570727  10/12/2021 11:32:00     12471.0         Germany          -1   -1.45
3       549106    4/6/2021 12:08:00     17045.0  United Kingdom           1   39.95
4       573112  10/27/2021 15:33:00     16416.0  United Kingdom         357  344.83

In [141]:
# Convertendo a coluna 'Data da fatura' para o formato datetime64
vendas['Data da fatura'] = pd.to_datetime(vendas['Data da fatura'], format='%m/%d/%Y %H:%M:%S')

# Separando a coluna 'Data da fatura' em colunas 'Data' e 'Horario'
vendas['Data'] = vendas['Data da fatura'].dt.date
vendas['Horario'] = vendas['Data da fatura'].dt.time

# Exibindo o DataFrame com as novas colunas
print(vendas[['Data da fatura', 'Data', 'Horario']])

           Data da fatura        Data   Horario
0     2021-03-30 16:14:00  2021-03-30  16:14:00
1     2021-11-11 11:11:00  2021-11-11  11:11:00
2     2021-10-12 11:32:00  2021-10-12  11:32:00
3     2021-04-06 12:08:00  2021-04-06  12:08:00
4     2021-10-27 15:33:00  2021-10-27  15:33:00
...                   ...         ...       ...
25948 2021-06-13 10:53:00  2021-06-13  10:53:00
25949 2021-05-13 10:44:00  2021-05-13  10:44:00
25950 2021-11-17 13:58:00  2021-11-17  13:58:00
25951 2021-04-14 12:39:00  2021-04-14  12:39:00
25952 2020-12-09 11:44:00  2020-12-09  11:44:00

[25940 rows x 3 columns]

In [142]:
# Conferindo os tipos de dados após as mudanças
vendas.info()

<class 'pandas.core.frame.DataFrame'>
Index: 25940 entries, 0 to 25952
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   N° da fatura    25940 non-null  object
 1   Data da fatura  25940 non-null  datetime64[ns]
 2   ID Cliente      22221 non-null  float64
 3   País            25940 non-null  object
 4   Quantidade      25940 non-null  int64
 5   Valor           25940 non-null  float64
 6   Data            25940 non-null  object
 7   Horario         25940 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 1.8+ MB

In [143]:
# Exibindo novamente as 5 primeiras linhas para ver como ficou o DataFrame
vendas.head(5)

  N° da fatura      Data da fatura  ID Cliente            País  Quantidade   Valor        Data   Horario
0       548370 2021-03-30 16:14:00     15528.0  United Kingdom         123  229.33  2021-03-30  16:14:00
1       575767 2021-11-11 11:11:00     17348.0  United Kingdom         163  209.73  2021-11-11  11:11:00
2      C570727 2021-10-12 11:32:00     12471.0         Germany          -1   -1.45  2021-10-12  11:32:00
3       549106 2021-04-06 12:08:00     17045.0  United Kingdom           1   39.95  2021-04-06  12:08:00
4       573112 2021-10-27 15:33:00     16416.0  United Kingdom         357  344.83  2021-10-27  15:33:00

In [144]:
# Criando colunas de data e hora no formato BR
vendas['Data'] = pd.to_datetime(vendas['Data'])
vendas['DataBR'] = vendas['Data'].dt.strftime('%d/%m/%Y')
vendas['Horario'] = pd.to_datetime(vendas['Horario'], format='%H:%M:%S').dt.time
vendas = vendas.drop('Data', axis=1)


# Exibindo o DataFrame com as novas colunas
print(vendas[['DataBR', 'Horario']])

           DataBR   Horario
0      30/03/2021  16:14:00
1      11/11/2021  11:11:00
2      12/10/2021  11:32:00
3      06/04/2021  12:08:00
4      27/10/2021  15:33:00
...           ...       ...
25948  13/06/2021  10:53:00
25949  13/05/2021  10:44:00
25950  17/11/2021  13:58:00
25951  14/04/2021  12:39:00
25952  09/12/2020  11:44:00

[25940 rows x 2 columns]

In [145]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
Index: 25940 entries, 0 to 25952
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   N° da fatura    25940 non-null  object
 1   Data da fatura  25940 non-null  datetime64[ns]
 2   ID Cliente      22221 non-null  float64
 3   País            25940 non-null  object
 4   Quantidade      25940 non-null  int64
 5   Valor           25940 non-null  float64
 6   Horario         25940 non-null  object
 7   DataBR          25940 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 1.8+ MB

In [146]:
# Verificando se existem valores duplicados
total_duplicatas = vendas.duplicated(subset=['N° da fatura']).sum()
print(total_duplicatas)

53

In [147]:
# Verificando dados duplicados na coluna 'N° da fatura'
dados_duplicados = vendas[vendas.duplicated(subset=['N° da fatura'], keep=False)]

# Exibindo os dados duplicados
print(dados_duplicados[['N° da fatura', 'ID Cliente', 'DataBR', 'Quantidade', 'Valor']])

      N° da fatura  ID Cliente      DataBR  Quantidade    Valor
376         542806     12836.0  01/02/2021         254   798.99
654         546388         NaN  11/03/2021         548  2472.63
1348        542806     12836.0  01/02/2021           6    47.70
1377        541809         NaN  21/01/2021         249  1343.71
1568       C581384     17673.0  08/12/2021          -2    -6.90
...            ...         ...         ...         ...      ...
24929       546986     14194.0  18/03/2021          76   213.98
25053       553556     17530.0  17/05/2021          34    81.50
25094       550333     15410.0  17/04/2021         111   258.85
25610       542217     14606.0  26/01/2021          12     7.80
25704       568404         NaN  27/09/2021         -17     0.00

[106 rows x 5 columns]

In [148]:
# Removendo linhas duplicadas com base na coluna 'N° da fatura'
vendas_sem_duplicatas = vendas.drop_duplicates(subset=['N° da fatura'])

# Exibindo o DataFrame sem as linhas duplicadas
print(vendas_sem_duplicatas)

      N° da fatura      Data da fatura  ID Cliente            País  Quantidade    Valor   Horario      DataBR
0           548370 2021-03-30 16:14:00     15528.0  United Kingdom         123   229.33  16:14:00  30/03/2021
1           575767 2021-11-11 11:11:00     17348.0  United Kingdom         163   209.73  11:11:00  11/11/2021
2          C570727 2021-10-12 11:32:00     12471.0         Germany          -1    -1.45  11:32:00  12/10/2021
3           549106 2021-04-06 12:08:00     17045.0  United Kingdom           1    39.95  12:08:00  06/04/2021
4           573112 2021-10-27 15:33:00     16416.0  United Kingdom         357   344.83  15:33:00  27/10/2021
...            ...                 ...         ...             ...         ...      ...       ...         ...
25948      C556518 2021-06-13 10:53:00     16794.0  United Kingdom          -2   -12.70  10:53:00  13/06/2021
25949       553060 2021-05-13 10:44:00     15826.0  United Kingdom         488   720.00  10:44:00  13/05/2021
25950       577049 2021-11-17 13:58:00     17397.0  United Kingdom         104   298.78  13:58:00  17/11/2021
25951       550122 2021-04-14 12:39:00     12931.0  United Kingdom        1176  1488.00  12:39:00  14/04/2021
25952       537999 2020-12-09 11:44:00         NaN  United Kingdom        -223     0.00  11:44:00  09/12/2020

[25887 rows x 8 columns]

In [149]:
# Criando um novo DataFrame com os pedidos devolvidos
pedidos_devolvidos = vendas_sem_duplicatas[(vendas_sem_duplicatas['Quantidade'] < 0) | (vendas_sem_duplicatas['Valor'] < 0)]
print(pedidos_devolvidos)

      N° da fatura      Data da fatura  ID Cliente            País  Quantidade  Valor   Horario      DataBR
2          C570727 2021-10-12 11:32:00     12471.0         Germany          -1  -1.45  11:32:00  12/10/2021
10         C543628 2021-02-10 15:51:00     16558.0  United Kingdom          -5  -9.25  15:51:00  10/02/2021
16          542418 2021-01-27 17:39:00         NaN  United Kingdom         -17   0.00  17:39:00  27/01/2021
17         C553508 2021-05-17 13:44:00     14000.0  United Kingdom          -3  -1.95  13:44:00  17/05/2021
20         C577693 2021-11-21 11:48:00     12628.0         Germany          -3 -16.85  11:48:00  21/11/2021
...            ...                 ...         ...             ...         ...    ...       ...         ...
25943      C557061 2021-06-16 14:55:00     14895.0  United Kingdom          -5 -14.75  14:55:00  16/06/2021
25944      C562147 2021-08-03 10:47:00     16180.0  United Kingdom          -7 -18.35  10:47:00  03/08/2021
25947      C553519 2021-05-17 14:16:00     18218.0  United Kingdom          -2  -9.90  14:16:00  17/05/2021
25948      C556518 2021-06-13 10:53:00     16794.0  United Kingdom          -2 -12.70  10:53:00  13/06/2021
25952       537999 2020-12-09 11:44:00         NaN  United Kingdom        -223   0.00  11:44:00  09/12/2020

[5174 rows x 8 columns]

In [150]:
pedidos_devolvidos.shape

(5174, 8)

In [151]:
pedidos_devolvidos.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5174 entries, 2 to 25952
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   N° da fatura    5174 non-null   object
 1   Data da fatura  5174 non-null   datetime64[ns]
 2   ID Cliente      3654 non-null   float64
 3   País            5174 non-null   object
 4   Quantidade      5174 non-null   int64
 5   Valor           5174 non-null   float64
 6   Horario         5174 non-null   object
 7   DataBR          5174 non-null   object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 363.8+ KB

In [152]:
vendas_sem_duplicatas.info()

<class 'pandas.core.frame.DataFrame'>
Index: 25887 entries, 0 to 25952
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   N° da fatura    25887 non-null  object
 1   Data da fatura  25887 non-null  datetime64[ns]
 2   ID Cliente      22182 non-null  float64
 3   País            25887 non-null  object
 4   Quantidade      25887 non-null  int64
 5   Valor           25887 non-null  float64
 6   Horario         25887 non-null  object
 7   DataBR          25887 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 1.8+ MB